tutorials/reactingFoam/shearlayer_DLB_pyJac/constant/foam_mech/README
You need to generate the libc_pyjac.so file for the mechanism and put it here!
