tutorials/reactingFoam/shearlayer_DLB_pyJac/Allrun
blockMesh
N_PROCS=$(grep -c ^processor /proc/cpuinfo)
foamDictionary -entry NCORES system/decomposeParDict -set $N_PROCS

rm -rf 0
cp -r 0.org 0

decomposePar -force > log.decompose
mpirun -np $N_PROCS reactingFoam -parallel > log.reactingFoam

